## Titanic Survival Prediction

Naive Bayes models are created to predict whether a person would survive a Titanic crash or not.

### Gathering dataset and importing necessary modules

In [76]:
import pandas as pd
import numpy as np

In [77]:
df=pd.read_csv("C:/Users/rishu/Downloads/archive/train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Cleaning of dataset

In [78]:
df=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [79]:
target = df.Survived

In [80]:
data= df.drop('Survived',axis='columns')

### Assigning Dummy variables to Sex column

In [81]:
dummies = pd.get_dummies(df.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [82]:
df1=pd.concat([data,dummies],axis=1)
df1.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [83]:
df1=df1.drop('Sex',axis=1)
df1.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [84]:
df1.columns[df1.isna().any()]

Index(['Age'], dtype='object')

In [85]:
df1.Age=df1.Age.fillna(df1.Age.mean())

In [86]:
df1.columns[df1.isna().any()]

Index([], dtype='object')

### Splitting of dataset into train and test data for Prediction

In [87]:
from sklearn.model_selection import train_test_split

In [88]:
X_train,X_test,y_train,y_test = train_test_split (df1,target,test_size=0.2,random_state=40)

In [89]:
len(X_train)

712

In [90]:
len(X_test)

179

In [91]:
len(y_train)

712

### Naive Bayes

In [92]:
from sklearn.naive_bayes import GaussianNB
from sklearn.naive_bayes import MultinomialNB
from sklearn.naive_bayes import BernoulliNB

In [93]:
model = GaussianNB()
model.fit(X_train,y_train)

GaussianNB()

In [94]:
from sklearn import metrics

In [95]:
y_pred = model.predict(X_test)
print('\nNaive Bayes_Gaussian')
print('Accuracy Score: ',metrics.accuracy_score(y_test,y_pred)*100,'%',sep='')

Naive Bayes_Gaussian
Accuracy Score: 81.00558659217877%

In [96]:
model = MultinomialNB()
model.fit(X_train,y_train)

MultinomialNB()

In [97]:
y_pred = model.predict(X_test)
print('\nNaive Bayes_Multinomial')
print('Accuracy Score: ',metrics.accuracy_score(y_test,y_pred)*100,'%',sep='')

Naive Bayes_Multinomial
Accuracy Score: 70.39106145251397%

In [98]:
model = BernoulliNB()
model.fit(X_train,y_train)

BernoulliNB()

In [99]:
y_pred = model.predict(X_test)
print('\nNaive Bayes_Bernoulli')
print('Accuracy Score: ',metrics.accuracy_score(y_test,y_pred)*100,'%',sep='')

Naive Bayes_Bernoulli
Accuracy Score: 80.44692737430168%

### Conclusion

We can conclude that Gaussian Naive Bayes Model gives more accuracy and hence, does better and more accurate prediction whether a person would survive a Titanic crash or not.